emas/loadtest/emas-performance-report/raw_data/sp4/250cus/varnish_ab_test_250_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   27.930 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      325520000 bytes
HTML transferred:       319660000 bytes
Requests per second:    358.03 [#/sec] (mean)
Time per request:       698.258 [ms] (mean)
Time per request:       2.793 [ms] (mean, across all concurrent requests)
Transfer rate:          11381.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  220  54.1    213     306
Processing:    59  472  68.2    482    1342
Waiting:        3  221  68.3    203    1149
Total:         67  692  59.1    698    1345

Percentage of the requests served within a certain time (ms)
  50%    698
  66%    698
  75%    698
  80%    699
  90%    700
  95%    700
  98%    702
  99%    703
 100%   1345 (longest request)