emas/loadtest/emas-performance-report/raw_data/sp4/250cus/varnish_ab_test_250_100000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   279.250 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Total transferred:      3255200000 bytes
HTML transferred:       3196600000 bytes
Requests per second:    358.10 [#/sec] (mean)
Time per request:       698.124 [ms] (mean)
Time per request:       2.792 [ms] (mean, across all concurrent requests)
Transfer rate:          11383.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  227  39.2    237     292
Processing:    61  471  42.0    461    1351
Waiting:        3  223  41.7    225    1166
Total:         70  697  20.1    698    1354

Percentage of the requests served within a certain time (ms)
  50%    698
  66%    698
  75%    699
  80%    699
  90%    700
  95%    701
  98%    703
  99%    703
 100%   1354 (longest request)